# Используем официальный образ Node.js
FROM node:18

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json в контейнер
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в рабочую директорию контейнера
COPY . .

# Открываем порт для приложения
EXPOSE 5000

# Устанавливаем переменные окружения из файла .env
COPY .env .

# Указываем команду для запуска приложения
CMD ["npm", "run", "start"]
